
# -*- coding: utf-8 -*-
"""
@Time ：2021/2/1 10:53
@Auth ：wutong
@File ：lz.py
@IDE ：PyCharm
"""

"""此模板来自网络，做了小小改动 ！！！"""

lzStr = '''\t\t你好啊! 我({name})已决定于2050年4月15日正式离职，\n
\t\t所以特提前半月向您提交这份辞职申请。\n
\t\t还请留意一下简历中是否有适合接替我工作的人选，\n
\t\t感激你这几年对我的照顾和帮忙，十分感激!\n
\t\t最近在整理自我的简历，突然发觉这几年我在公司做的工种实在太多了，\n
\t\t细数一下，有不下十种。\n
\t\t先是1900年3月从前台开始做起，\n
\t\t然后是人事，行政，市场开拓，婚庆，护肤品牌信息收集，再到之后的外贸。\n
\t\t还有兼职文案，校对，送货，以及各种各样的手工。\n
\t\t并且大多数时候我同时在做好几件事情，\n
\t\t虽然我从来没有抱怨过我的工作太多可是这并不表示我的工作量小。\n
\t\t并且我所有的工作都有做完的那天，或者是被人接手的那一天，\n
\t\t这也就意味着一个新的工作即将来临。\n
\t\t有时候就觉得自我是个高级打杂工，真的太杂了，\n
\t\t杂到我此刻已经搞不清楚我自我能干什么，想干什么，\n
\t\t我此刻对自我的职业定位和前程也是一片迷茫。\n
\t\t所以，我此刻想休息一下，为自我的将来好好打算一下，\n
\t\t重新规划自我的职业和人生。\n\n

\t\t记得年前已经跟你谈过一次，谈过我的想法，\n
\t\t所以想必我的辞职对你来说应当不会太意外。\n
\t\t我是公司刚起步不久就过来帮你创业了，\n
\t\t到此刻为止已经做了快3年多了，\n
\t\t看着公司一天天成长壮大，慢慢的走上正轨我心里也是蛮高兴的。\n
\t\t老实说离开公司多少还是有些不舍。我明白你的想法点子也很多，\n
\t\t以前每一次你有新想法我都很支持你，\n
\t\t都会全心全意按着你的想法去做事。\n
\t\t公司出现了什么问题，我都会尽我最大的努力去帮你处理好\n
\t\t因为我很重承诺，我答应的事情必须会做到。\n\n

\t\t此刻公司已经走上正轨并且新鲜血液不断供给，\n
\t\t我想我能够激流勇退了，也请你给我一次机会，\n
\t\t一次让我实现自我想法的机会。\n

\t\t{name}\t2050-04-15 04:15:15\n
'''